#+TITLE: APIsnoop Tables and Views
#+AUTHOR: ii team
#+DATE: 07 October 2019
#+INCLUDE: "config.org"
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | TADA(d)
#+ARCHIVE: archive/tables_and_views.archive.org::
#+PROPERTY: header-args:sql-mode+ :results silent


** 910: populate_audit_events.up.sql
  :PROPERTIES:
  :header-args:sql-mode+: :notangle ../apps/hasura/migrations/900_populate_audit_events.up.sql
  :END:

We could load audit_events directly from test-grid via bucket and job.
However they do NOT include the OperationID.
It's computationally expensive... nearly 30 minutes on a 56 Xeon core box with 300+ gigs of ram.

Might be good to instead save our processed audit_events via

#+BEGIN_SRC shell :eval never
pg_dump --host=$PGHOST --port=$PGPORT --username=$PGUSER --dbname=$PGDATABASE --table=raw_audit_event
 > $BUCKET.$JOB.sql 
#+END_SRC

Which we could easily load via:

#+BEGIN_SRC shell :eval
psql < /tmp/ci-kubernetes-e2e-gci-gce.1165794879855398916.sql
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE

